Tekla Open API Reference for Tekla Structures 2025
PlacingDirectionAttributes Constructor (Boolean, Boolean)
 Creates a new placing direction attributes instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PlacingDirectionAttributes(
	bool positive,
	bool negative
)
Public Sub New (
	positive As Boolean,
	negative As Boolean
)
Parameters
positive
Type: System.Boolean
Sets the positive direction.
negative
Type: System.Boolean
Sets the negative direction.
See Also
Reference
PlacingDirectionAttributes Class
PlacingDirectionAttributes Overload
Tekla.Structures.Drawing Namespace